# Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором.

set_1 = set(['White', 'Black', 'Red'])
set_2 = set(['Red', 'Green'])

print(set_1 - set_2)
